app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("post_id", "user_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post_id", 1], ["user_id", 0], ["text", "testttttttt"], ["created_at", "2016-08-27 22:34:55.065347"], ["updated_at", "2016-08-27 22:34:55.065347"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment_id])
    @comment.user_id = params[:comment][:user_id]
    @comment.text = params[:comment][:text]
    @comment.save