app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "1er"], ["text", " fgdgdfgdfg"], ["user_id", 1], ["created_at", "2016-08-27 23:48:24.931812"], ["updated_at", "2016-08-27 23:48:24.931812"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save